const PhRFLITitle = require('../models/ph_r_f_l_i_title');

PhRFLITitle.deleteAll();

let arr = [
    {title: 'Тривалість'},
    {title: 'Темп'},
    {title: 'Режим'},
    {title: 'Види'},
    {title: 'Температура'},
    {title: 'Холодове навантаження'},
    {title: 'Середня експозиція'},
    {title: 'Температура води'},
    {title: 'Темп плавання'},
    {title: 'Інтенсивність'},
    {title: 'Час доби'},
    {title: 'Метод проведення'},
    {title: 'Місце проведення'},
    {title: 'Час проведення'},
    {title: 'Вихідне положення'},
    {title: 'Кількість вправ'},
    {title: 'Кількість повторень вправ'},
    {title: 'Складність рухів'},
    {title: 'Контроль'},
    {title: 'Співвідношення загально-зміцнювальних та дихальних вправ'},
    {title: 'Ступінь силового зусилля'},
    {title: 'Максимально допустиме зростання ЧСС'},
    {title: 'Амплітуда'},
    {title: 'Моторна щільність'},
    {title: 'Співвідношення загально-зміцнювальних до спеціальних вправ'},
    {title: 'Види вправ'},
    {title: 'Відстань'},
    {title: 'Швидкість'},
    {title: 'Характер місцевості '},
    {title: 'Кут підйому'},
    {title: 'Характер, навантаження'},
    {title: 'Частота'},
    {title: 'Висота'},
    {title: 'Енерговитрати'},
    {title: 'Належне максимальне споживання O2'},
    {title: 'Енергетичний рівень'},
    {title: 'Граничний вік'},
];

module.exports = new Promise((resolve, reject) => {
    PhRFLITitle.create(arr, (err, res) => {
        if (err) {
            reject(err)
        } else {
            resolve(res)
        }
    });
});


